---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.GetCutLayerModifiers
source: html/70a80f11-165c-14ce-fcea-d19dba6591ee.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.GetCutLayerModifiers Method

Gets all the cut layer modifiers from the layer info.

## Syntax (C#)
```csharp
public IList<LayerModifier> GetCutLayerModifiers()
```

## Returns
The cut layer modifier array.